DROP TABLE IF EXISTS students;

CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    last_name TEXT NOT NULL,
    first_name TEXT NOT NULL,
    middle_name TEXT,
    birth_date TEXT NOT NULL,
    gradebook_number TEXT NOT NULL
);

INSERT INTO students (last_name, first_name, middle_name, birth_date, gradebook_number) VALUES
('Петренко', 'Андрій', 'Олегович', '2003-01-12', 'KB001'),
('Іваненко', 'Марія', 'Петрівна', '2002-01-25', 'KB002'),
('Сидоренко', 'Юлія', 'Ігорівна', '2002-02-05', 'KB003'),
('Ткаченко', 'Олег', 'Сергійович', '2002-02-28', 'KB004'),
('Коваль', 'Ірина', 'Андріївна', '2003-03-22', 'KB005'),
('Шевченко', 'Назар', 'Іванович', '2003-03-06', 'KB006'),
('Мельник', 'Катерина', 'Володимирівна', '2003-04-10', 'KB007'),
('Романюк', 'Олексій', 'Павлович', '2003-04-15', 'KB008'),
('Демчук', 'Олена', 'Романівна', '2002-05-07', 'KB009'),
('Гордієнко', 'Оксана', 'Михайлівна', '2003-05-26', 'KB010'),
('Литвин', 'Сергій', 'Олегович', '2003-07-18', 'KB011'),
('Марченко', 'Анна', 'Артемівна', '2002-07-27', 'KB012'),
('Захарченко', 'Тарас', 'Кирилович', '2003-08-10', 'KB013'),
('Бондар', 'Роман', 'Олександрович', '2003-08-30', 'KB014'),
('Саюк', 'Ілона', 'Петрівна', '2002-09-13', 'KB015'),
('Нагнішпір', 'Юрій', 'Олександрович', '2003-09-18', 'KB016'),
('Пилипенко', 'Арсен', 'Олегович', '2003-10-05', 'KB017'),
('Левченко', 'Юлія', 'Миколаївна', '2002-10-23', 'KB018'),
('Мазур', 'Богдан', 'Петрович', '2002-11-11', 'KB019'),
('Герасименко', 'Вікторія', 'Андріївна', '2002-12-02', 'KB020');
